/*
Navicat MySQL Data Transfer

Source Server         : localhost_3306
Source Server Version : 50547
Source Host           : localhost:3306
Source Database       : qmss

Target Server Type    : MYSQL
Target Server Version : 50547
File Encoding         : 65001

Date: 2017-07-03 13:00:55
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `tp_address`
-- ----------------------------
DROP TABLE IF EXISTS `tp_address`;
CREATE TABLE `tp_address` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `user_id` int(10) unsigned NOT NULL,
  `name` varchar(40) NOT NULL,
  `phone` bigint(12) unsigned NOT NULL,
  `address` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=14 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of tp_address
-- ----------------------------
INSERT INTO `tp_address` VALUES ('10', '5', 'fdg', '2147483647', '吉林省 长春市 市辖区 dfgdfg');
INSERT INTO `tp_address` VALUES ('13', '4', 'dsfds', '18336253749', '北京市 市辖区 东城区 sdfsd');

-- ----------------------------
-- Table structure for `tp_admin`
-- ----------------------------
DROP TABLE IF EXISTS `tp_admin`;
CREATE TABLE `tp_admin` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `username` varchar(35) NOT NULL,
  `password` varchar(35) NOT NULL,
  `email` varchar(50) NOT NULL,
  `level` text NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=7 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of tp_admin
-- ----------------------------
INSERT INTO `tp_admin` VALUES ('3', 'admin', '21232f297a57a5a743894a0e4a801fc3', 'sfds@qq.com', '[\"1\",\"2\",\"3\",\"4\",\"5\",\"6\",\"7\",\"8\",\"9\",\"10\",\"11\",\"12\",\"13\",\"14\",\"15\",\"16\",\"17\",\"18\",\"19\",\"20\",\"21\",\"22\",\"23\",\"24\",\"25\",\"26\",\"27\",\"28\"]');
INSERT INTO `tp_admin` VALUES ('2', 'admin001', '21232f297a57a5a743894a0e4a801fc3', 'sfds@qq.com', '[\"8\",\"9\",\"10\",\"11\",\"12\",\"13\",\"14\",\"15\"]');
INSERT INTO `tp_admin` VALUES ('6', 'admin002', '21232f297a57a5a743894a0e4a801fc3', 'asd@qq.com', '[\"4\",\"5\"]');

-- ----------------------------
-- Table structure for `tp_banner`
-- ----------------------------
DROP TABLE IF EXISTS `tp_banner`;
CREATE TABLE `tp_banner` (
  `id` int(5) unsigned NOT NULL AUTO_INCREMENT,
  `image` varchar(255) NOT NULL,
  `pro_id` int(10) unsigned NOT NULL,
  `create_time` int(11) unsigned NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=8 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of tp_banner
-- ----------------------------
INSERT INTO `tp_banner` VALUES ('7', './Uploads/banner/2017-06-19/5947b049124d8.jpg', '8', '1497870409');
INSERT INTO `tp_banner` VALUES ('5', './Uploads/banner/2017-05-25/59267c6aa7e5d.jpg', '6', '1495694442');
INSERT INTO `tp_banner` VALUES ('6', './Uploads/banner/2017-05-25/59267c7a22530.jpg', '8', '1495694458');

-- ----------------------------
-- Table structure for `tp_brand`
-- ----------------------------
DROP TABLE IF EXISTS `tp_brand`;
CREATE TABLE `tp_brand` (
  `id` int(2) unsigned NOT NULL AUTO_INCREMENT,
  `image` varchar(255) NOT NULL,
  `content` text NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of tp_brand
-- ----------------------------
INSERT INTO `tp_brand` VALUES ('1', './Uploads/brand/2017-05-25/59263a7b4e6f0.jpeg', '<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 青木三色创立于1993年，是集开发、生产、销售、品牌运营为一体的大型服装公司，公司自创立始一直秉承“以人为本、快乐分享”的人文理念，经过十六年的发展，公司已由原来的几十人发展至现今逾千人的中型著名女装企业，且凭借优良的品质、准确的市场定位、合理的价格优势，深受广大都市女性消费者的青睐。同时我们本着“先做深度再做广度”的发展观,发挥区域为王的品牌优势,营销网络遍及福建、广东、湖南、湖北、江苏、四川、安徽等省市市场在未来的规划里，集团</p><p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 公司将仍以建立自己独特的企业文化和品牌文化为主题；以“团队、坚持、拼搏、责任”的经营理念引入现代企业管理机制，着力企业、品牌系列化标准建设，并确立及坚定不移地贯彻“人才谋盛世，标准定乾坤”的指导思想，吸纳优秀的青年才俊加入我们的精英团队，打造成管理规范化的时尚都市女装的航空母</p>');

-- ----------------------------
-- Table structure for `tp_contact`
-- ----------------------------
DROP TABLE IF EXISTS `tp_contact`;
CREATE TABLE `tp_contact` (
  `id` int(2) unsigned NOT NULL AUTO_INCREMENT,
  `url` varchar(50) NOT NULL,
  `phone` varchar(20) NOT NULL,
  `qq` bigint(20) unsigned NOT NULL,
  `email` varchar(50) NOT NULL,
  `address` varchar(255) NOT NULL,
  `official_image` varchar(255) NOT NULL,
  `service_image` varchar(255) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of tp_contact
-- ----------------------------
INSERT INTO `tp_contact` VALUES ('1', 'http://www.qm3s.com', '0592-5966253', '2024594934', '2024594934@qq.com', '厦门市湖里区华昌路132号华美空间文创园C1楼7A单元', './Uploads/contact/2017-06-02/5930c1ad43d7e.jpg', './Uploads/contact/2017-05-31/592e6e5a253a7.jpg');

-- ----------------------------
-- Table structure for `tp_members`
-- ----------------------------
DROP TABLE IF EXISTS `tp_members`;
CREATE TABLE `tp_members` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `user` char(20) NOT NULL,
  `password` varchar(50) NOT NULL,
  `email` varchar(255) NOT NULL,
  `phone` bigint(12) unsigned NOT NULL,
  `exp` int(10) unsigned zerofill NOT NULL,
  `vip` int(5) unsigned NOT NULL,
  `create_time` int(11) unsigned NOT NULL,
  `integral` int(10) unsigned NOT NULL,
  `coupons` int(5) unsigned NOT NULL,
  `address` int(10) unsigned NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=6 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of tp_members
-- ----------------------------
INSERT INTO `tp_members` VALUES ('4', 'aaaaaa', '5d793fc5b00a2348c3fb9ab59e5ca98a', '1321410656@qq.com', '2147483647', '0000002400', '5', '1496719394', '0', '0', '13');
INSERT INTO `tp_members` VALUES ('5', 'qqqqqq', '02a05c6e278d3e19afaca4f3f7cf47d9', '1321410656@qq.com', '2147483647', '0000000000', '1', '1496739572', '0', '0', '10');

-- ----------------------------
-- Table structure for `tp_message`
-- ----------------------------
DROP TABLE IF EXISTS `tp_message`;
CREATE TABLE `tp_message` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(20) NOT NULL,
  `phone` bigint(12) unsigned NOT NULL,
  `message` text NOT NULL,
  `time` int(11) unsigned NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=16 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of tp_message
-- ----------------------------
INSERT INTO `tp_message` VALUES ('1', 'sxsx', '2147483647', 'ssssssssssssssssssssss', '1497853317');
INSERT INTO `tp_message` VALUES ('2', 'fgfg', '2147483647', 'zabxucvgdfgdfg', '1497853510');
INSERT INTO `tp_message` VALUES ('12', 'wqeqw', '18336253749', 'sdfsdfsdf', '1498038041');
INSERT INTO `tp_message` VALUES ('4', 'sfdd', '2147483647', 'ssssssssssssssssssssss', '1497853317');
INSERT INTO `tp_message` VALUES ('13', 'fdgvsd', '18336253749', 'dsfdsf', '1498038176');
INSERT INTO `tp_message` VALUES ('6', 'sdfsd', '2147483647', 'ssssssssssssssssssssss', '1497853317');
INSERT INTO `tp_message` VALUES ('7', 'sdfsd', '2147483647', 'ssssssssssssssssssssss', '1497853317');
INSERT INTO `tp_message` VALUES ('8', 'sdfsdf', '2147483647', 'ssssssssssssssssssssss', '1497853317');
INSERT INTO `tp_message` VALUES ('9', 'sdfdsf', '2147483647', 'ssssssssssssssssssssss', '1497853317');
INSERT INTO `tp_message` VALUES ('10', 'dsf', '2147483647', 'dsfsdfwsfsdfs', '1497853599');
INSERT INTO `tp_message` VALUES ('11', '奉答固道', '18336253749', '写程序下次V型从保存v能不能返回给', '1497856284');
INSERT INTO `tp_message` VALUES ('14', 'fdgvsd', '18336253749', 'dsfdsf', '1498038208');
INSERT INTO `tp_message` VALUES ('15', 'qweqwe', '18336253749', 'sdsdsdfs', '1498038285');

-- ----------------------------
-- Table structure for `tp_news`
-- ----------------------------
DROP TABLE IF EXISTS `tp_news`;
CREATE TABLE `tp_news` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `title` varchar(255) NOT NULL,
  `author` varchar(30) NOT NULL,
  `content` text NOT NULL,
  `image` text NOT NULL,
  `create_time` int(11) unsigned NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=15 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of tp_news
-- ----------------------------
INSERT INTO `tp_news` VALUES ('2', '111111', '111111', '大企业忙于品牌建设，小企业忙于眼前利益的争夺\r\n\r\n品牌是企业的灵魂和存在与发展的核心动力。消费者对品牌的认同，意味着企业可以花费较少的成本让产品和服务具有更强的竞争力，从而获得更大的市场占有率。\r\n\r\n对那些有能力进行大张旗鼓的品牌建设的企业而言，品牌建设的基础是文化，核心是产品设计，从而提供蕴含企业独特文化符号的产品，用品牌产生的联动效应促使企业的效益目标达成。而品牌建设的具体落地措施，各个企业的操作形式也各不相同。比如作为缝制设备行业的龙头企业上海和鹰科技，除了常规的品牌建设途径之外，近期正在组织“游日本，赏樱花”的1500人旅行团，用近一周的时间遍游大阪、长崎等地，以一场视觉盛宴，打响2016年新年品牌建设第一役。表面上看，似乎仅仅是“游山玩水”，实际上也起到了拓展合作伙伴、员工的视野，从而增强对那些有能力进行大张旗鼓的品牌建设的企业而言，品牌建设的基础是文化，核心是产品设计，从而提供蕴含企业独特文化符号的产品，用品牌产生的联动效应促使企业的效益目标达成。而品牌建设的具体落地措施，各个企业的操作形式也各不相同。比如作为缝制设备行业的龙头企业上海和鹰科技，除了常规的品牌建设途径之外，近期正在组织“游日本，赏樱花”的1500人旅行团，用近一周的时间遍游大阪、长崎等地，以一场视觉盛宴，打响2016年新年品牌建设第一役。表面上看，似乎仅仅是“游山玩水”，实际上也起到了拓展合作伙伴、员工的视野，从而增强对那些有能力进行大张旗鼓的品牌建设的企业而言，品牌建设的基础是文化，核心是产品设计，从而提供蕴含企业独特文化符号的产品，用品牌产生的联动效应促使企业的效益目标达成。而品牌建设的具体落地措施，各个企业的操作形式也各不相同。比如作为缝制设备行业的龙头企业上海和鹰科技，除了常规的品牌建设途径之外，近期正在组织“游日本，赏樱花”的1500人旅行团，用近一周的时间遍游大阪、长崎等地，以一场视觉盛宴，打响2016年新年品牌建设第一役。表面上看，似乎仅仅是“游山玩水”，实际上也起到了拓展合作伙伴、员工的视野，从而增强对那些有能力进行大张旗鼓的品牌建设的企业而言，品牌建设的基础是文化，核心是产品设计，从而提供蕴含企业独特文化符号的产品，用品牌产生的联动效应促使企业的效益目标达成。而品牌建设的具体落地措施，各个企业的操作形式也各不相同。比如作为缝制设备行业的龙头企业上海和鹰科技，除了常规的品牌建设途径之外，近期正在组织“游日本，赏樱花”的1500人旅行团，用近一周的时间遍游大阪、长崎等地，以一场视觉盛宴，打响2016年新年品牌建设第一役。表面上看，似乎仅仅是“游山玩水”，实际上也起到了拓展合作伙伴、员工的视野，从而增强;', '[\".\\/Uploads\\/news\\/2017-05-23\\/59239ad17aebf.jpg\",\".\\/Uploads\\/news\\/2017-05-23\\/59239ad17d1e8.jpeg\"]', '1495505618');
INSERT INTO `tp_news` VALUES ('3', '2222', '2222', '大企业忙于品牌建设，小企业忙于眼前利益的争夺\r\n\r\n品牌是企业的灵魂和存在与发展的核心动力。消费者对品牌的认同，意味着企业可以花费较少的成本让产品和服务具有更强的竞争力，从而获得更大的市场占有率。\r\n\r\n对那些有能力进行大张旗鼓的品牌建设的企业而言，品牌建设的基础是文化，核心是产品设计，从而提供蕴含企业独特文化符号的产品，用品牌产生的联动效应促使企业的效益目标达成。而品牌建设的具体落地措施，各个企业的操作形式也各不相同。比如作为缝制设备行业的龙头企业上海和鹰科技，除了常规的品牌建设途径之外，近期正在组织“游日本，赏樱花”的1500人旅行团，用近一周的时间遍游大阪、长崎等地，以一场视觉盛宴，打响2016年新年品牌建设第一役。表面上看，似乎仅仅是“游山玩水”，实际上也起到了拓展合作伙伴、员工的视野，从而增强对那些有能力进行大张旗鼓的品牌建设的企业而言，品牌建设的基础是文化，核心是产品设计，从而提供蕴含企业独特文化符号的产品，用品牌产生的联动效应促使企业的效益目标达成。而品牌建设的具体落地措施，各个企业的操作形式也各不相同。比如作为缝制设备行业的龙头企业上海和鹰科技，除了常规的品牌建设途径之外，近期正在组织“游日本，赏樱花”的1500人旅行团，用近一周的时间遍游大阪、长崎等地，以一场视觉盛宴，打响2016年新年品牌建设第一役。表面上看，似乎仅仅是“游山玩水”，实际上也起到了拓展合作伙伴、员工的视野，从而增强对那些有能力进行大张旗鼓的品牌建设的企业而言，品牌建设的基础是文化，核心是产品设计，从而提供蕴含企业独特文化符号的产品，用品牌产生的联动效应促使企业的效益目标达成。而品牌建设的具体落地措施，各个企业的操作形式也各不相同。比如作为缝制设备行业的龙头企业上海和鹰科技，除了常规的品牌建设途径之外，近期正在组织“游日本，赏樱花”的1500人旅行团，用近一周的时间遍游大阪、长崎等地，以一场视觉盛宴，打响2016年新年品牌建设第一役。表面上看，似乎仅仅是“游山玩水”，实际上也起到了拓展合作伙伴、员工的视野，从而增强对那些有能力进行大张旗鼓的品牌建设的企业而言，品牌建设的基础是文化，核心是产品设计，从而提供蕴含企业独特文化符号的产品，用品牌产生的联动效应促使企业的效益目标达成。而品牌建设的具体落地措施，各个企业的操作形式也各不相同。比如作为缝制设备行业的龙头企业上海和鹰科技，除了常规的品牌建设途径之外，近期正在组织“游日本，赏樱花”的1500人旅行团，用近一周的时间遍游大阪、长崎等地，以一场视觉盛宴，打响2016年新年品牌建设第一役。表面上看，似乎仅仅是“游山玩水”，实际上也起到了拓展合作伙伴、员工的视野，从而增强;', '[\".\\/Uploads\\/news\\/2017-05-23\\/59239edf32411.jpeg\",\".\\/Uploads\\/news\\/2017-05-23\\/59239edf33799.jpg\"]', '1495506655');
INSERT INTO `tp_news` VALUES ('4', '3333', '3333', '大企业忙于品牌建设，小企业忙于眼前利益的争夺\r\n\r\n品牌是企业的灵魂和存在与发展的核心动力。消费者对品牌的认同，意味着企业可以花费较少的成本让产品和服务具有更强的竞争力，从而获得更大的市场占有率。\r\n\r\n对那些有能力进行大张旗鼓的品牌建设的企业而言，品牌建设的基础是文化，核心是产品设计，从而提供蕴含企业独特文化符号的产品，用品牌产生的联动效应促使企业的效益目标达成。而品牌建设的具体落地措施，各个企业的操作形式也各不相同。比如作为缝制设备行业的龙头企业上海和鹰科技，除了常规的品牌建设途径之外，近期正在组织“游日本，赏樱花”的1500人旅行团，用近一周的时间遍游大阪、长崎等地，以一场视觉盛宴，打响2016年新年品牌建设第一役。表面上看，似乎仅仅是“游山玩水”，实际上也起到了拓展合作伙伴、员工的视野，从而增强对那些有能力进行大张旗鼓的品牌建设的企业而言，品牌建设的基础是文化，核心是产品设计，从而提供蕴含企业独特文化符号的产品，用品牌产生的联动效应促使企业的效益目标达成。而品牌建设的具体落地措施，各个企业的操作形式也各不相同。比如作为缝制设备行业的龙头企业上海和鹰科技，除了常规的品牌建设途径之外，近期正在组织“游日本，赏樱花”的1500人旅行团，用近一周的时间遍游大阪、长崎等地，以一场视觉盛宴，打响2016年新年品牌建设第一役。表面上看，似乎仅仅是“游山玩水”，实际上也起到了拓展合作伙伴、员工的视野，从而增强对那些有能力进行大张旗鼓的品牌建设的企业而言，品牌建设的基础是文化，核心是产品设计，从而提供蕴含企业独特文化符号的产品，用品牌产生的联动效应促使企业的效益目标达成。而品牌建设的具体落地措施，各个企业的操作形式也各不相同。比如作为缝制设备行业的龙头企业上海和鹰科技，除了常规的品牌建设途径之外，近期正在组织“游日本，赏樱花”的1500人旅行团，用近一周的时间遍游大阪、长崎等地，以一场视觉盛宴，打响2016年新年品牌建设第一役。表面上看，似乎仅仅是“游山玩水”，实际上也起到了拓展合作伙伴、员工的视野，从而增强对那些有能力进行大张旗鼓的品牌建设的企业而言，品牌建设的基础是文化，核心是产品设计，从而提供蕴含企业独特文化符号的产品，用品牌产生的联动效应促使企业的效益目标达成。而品牌建设的具体落地措施，各个企业的操作形式也各不相同。比如作为缝制设备行业的龙头企业上海和鹰科技，除了常规的品牌建设途径之外，近期正在组织“游日本，赏樱花”的1500人旅行团，用近一周的时间遍游大阪、长崎等地，以一场视觉盛宴，打响2016年新年品牌建设第一役。表面上看，似乎仅仅是“游山玩水”，实际上也起到了拓展合作伙伴、员工的视野，从而增强', '[\".\\/Uploads\\/news\\/2017-05-23\\/59239efe653a2.jpg\",\".\\/Uploads\\/news\\/2017-05-23\\/59239efe6a993.jpg\"]', '1495506686');
INSERT INTO `tp_news` VALUES ('6', '55555', '55555', '大企业忙于品牌建设，小企业忙于眼前利益的争夺\r\n\r\n品牌是企业的灵魂和存在与发展的核心动力。消费者对品牌的认同，意味着企业可以花费较少的成本让产品和服务具有更强的竞争力，从而获得更大的市场占有率。\r\n\r\n对那些有能力进行大张旗鼓的品牌建设的企业而言，品牌建设的基础是文化，核心是产品设计，从而提供蕴含企业独特文化符号的产品，用品牌产生的联动效应促使企业的效益目标达成。而品牌建设的具体落地措施，各个企业的操作形式也各不相同。比如作为缝制设备行业的龙头企业上海和鹰科技，除了常规的品牌建设途径之外，近期正在组织“游日本，赏樱花”的1500人旅行团，用近一周的时间遍游大阪、长崎等地，以一场视觉盛宴，打响2016年新年品牌建设第一役。表面上看，似乎仅仅是“游山玩水”，实际上也起到了拓展合作伙伴、员工的视野，从而增强对那些有能力进行大张旗鼓的品牌建设的企业而言，品牌建设的基础是文化，核心是产品设计，从而提供蕴含企业独特文化符号的产品，用品牌产生的联动效应促使企业的效益目标达成。而品牌建设的具体落地措施，各个企业的操作形式也各不相同。比如作为缝制设备行业的龙头企业上海和鹰科技，除了常规的品牌建设途径之外，近期正在组织“游日本，赏樱花”的1500人旅行团，用近一周的时间遍游大阪、长崎等地，以一场视觉盛宴，打响2016年新年品牌建设第一役。表面上看，似乎仅仅是“游山玩水”，实际上也起到了拓展合作伙伴、员工的视野，从而增强对那些有能力进行大张旗鼓的品牌建设的企业而言，品牌建设的基础是文化，核心是产品设计，从而提供蕴含企业独特文化符号的产品，用品牌产生的联动效应促使企业的效益目标达成。而品牌建设的具体落地措施，各个企业的操作形式也各不相同。比如作为缝制设备行业的龙头企业上海和鹰科技，除了常规的品牌建设途径之外，近期正在组织“游日本，赏樱花”的1500人旅行团，用近一周的时间遍游大阪、长崎等地，以一场视觉盛宴，打响2016年新年品牌建设第一役。表面上看，似乎仅仅是“游山玩水”，实际上也起到了拓展合作伙伴、员工的视野，从而增强对那些有能力进行大张旗鼓的品牌建设的企业而言，品牌建设的基础是文化，核心是产品设计，从而提供蕴含企业独特文化符号的产品，用品牌产生的联动效应促使企业的效益目标达成。而品牌建设的具体落地措施，各个企业的操作形式也各不相同。比如作为缝制设备行业的龙头企业上海和鹰科技，除了常规的品牌建设途径之外，近期正在组织“游日本，赏樱花”的1500人旅行团，用近一周的时间遍游大阪、长崎等地，以一场视觉盛宴，打响2016年新年品牌建设第一役。表面上看，似乎仅仅是“游山玩水”，实际上也起到了拓展合作伙伴、员工的视野，从而增强', '[\".\\/Uploads\\/news\\/2017-05-23\\/59239fefc07cf.jpg\",\".\\/Uploads\\/news\\/2017-05-23\\/59239fefc4650.jpg\"]', '1495506928');
INSERT INTO `tp_news` VALUES ('7', '66666', '6666', '大企业忙于品牌建设，小企业忙于眼前利益的争夺\r\n\r\n品牌是企业的灵魂和存在与发展的核心动力。消费者对品牌的认同，意味着企业可以花费较少的成本让产品和服务具有更强的竞争力，从而获得更大的市场占有率。\r\n\r\n对那些有能力进行大张旗鼓的品牌建设的企业而言，品牌建设的基础是文化，核心是产品设计，从而提供蕴含企业独特文化符号的产品，用品牌产生的联动效应促使企业的效益目标达成。而品牌建设的具体落地措施，各个企业的操作形式也各不相同。比如作为缝制设备行业的龙头企业上海和鹰科技，除了常规的品牌建设途径之外，近期正在组织“游日本，赏樱花”的1500人旅行团，用近一周的时间遍游大阪、长崎等地，以一场视觉盛宴，打响2016年新年品牌建设第一役。表面上看，似乎仅仅是“游山玩水”，实际上也起到了拓展合作伙伴、员工的视野，从而增强对那些有能力进行大张旗鼓的品牌建设的企业而言，品牌建设的基础是文化，核心是产品设计，从而提供蕴含企业独特文化符号的产品，用品牌产生的联动效应促使企业的效益目标达成。而品牌建设的具体落地措施，各个企业的操作形式也各不相同。比如作为缝制设备行业的龙头企业上海和鹰科技，除了常规的品牌建设途径之外，近期正在组织“游日本，赏樱花”的1500人旅行团，用近一周的时间遍游大阪、长崎等地，以一场视觉盛宴，打响2016年新年品牌建设第一役。表面上看，似乎仅仅是“游山玩水”，实际上也起到了拓展合作伙伴、员工的视野，从而增强对那些有能力进行大张旗鼓的品牌建设的企业而言，品牌建设的基础是文化，核心是产品设计，从而提供蕴含企业独特文化符号的产品，用品牌产生的联动效应促使企业的效益目标达成。而品牌建设的具体落地措施，各个企业的操作形式也各不相同。比如作为缝制设备行业的龙头企业上海和鹰科技，除了常规的品牌建设途径之外，近期正在组织“游日本，赏樱花”的1500人旅行团，用近一周的时间遍游大阪、长崎等地，以一场视觉盛宴，打响2016年新年品牌建设第一役。表面上看，似乎仅仅是“游山玩水”，实际上也起到了拓展合作伙伴、员工的视野，从而增强对那些有能力进行大张旗鼓的品牌建设的企业而言，品牌建设的基础是文化，核心是产品设计，从而提供蕴含企业独特文化符号的产品，用品牌产生的联动效应促使企业的效益目标达成。而品牌建设的具体落地措施，各个企业的操作形式也各不相同。比如作为缝制设备行业的龙头企业上海和鹰科技，除了常规的品牌建设途径之外，近期正在组织“游日本，赏樱花”的1500人旅行团，用近一周的时间遍游大阪、长崎等地，以一场视觉盛宴，打响2016年新年品牌建设第一役。表面上看，似乎仅仅是“游山玩水”，实际上也起到了拓展合作伙伴、员工的视野，从而增强', '[\".\\/Uploads\\/news\\/2017-05-23\\/5923e281e395a.jpg\",\".\\/Uploads\\/news\\/2017-05-23\\/5923e281e4512.jpg\"]', '1495507040');
INSERT INTO `tp_news` VALUES ('9', '666a', '6666', '大企业忙于品牌建设，小企业忙于眼前利益的争夺\r\n\r\n品牌是企业的灵魂和存在与发展的核心动力。消费者对品牌的认同，意味着企业可以花费较少的成本让产品和服务具有更强的竞争力，从而获得更大的市场占有率。\r\n\r\n对那些有能力进行大张旗鼓的品牌建设的企业而言，品牌建设的基础是文化，核心是产品设计，从而提供蕴含企业独特文化符号的产品，用品牌产生的联动效应促使企业的效益目标达成。而品牌建设的具体落地措施，各个企业的操作形式也各不相同。比如作为缝制设备行业的龙头企业上海和鹰科技，除了常规的品牌建设途径之外，近期正在组织“游日本，赏樱花”的1500人旅行团，用近一周的时间遍游大阪、长崎等地，以一场视觉盛宴，打响2016年新年品牌建设第一役。表面上看，似乎仅仅是“游山玩水”，实际上也起到了拓展合作伙伴、员工的视野，从而增强对那些有能力进行大张旗鼓的品牌建设的企业而言，品牌建设的基础是文化，核心是产品设计，从而提供蕴含企业独特文化符号的产品，用品牌产生的联动效应促使企业的效益目标达成。而品牌建设的具体落地措施，各个企业的操作形式也各不相同。比如作为缝制设备行业的龙头企业上海和鹰科技，除了常规的品牌建设途径之外，近期正在组织“游日本，赏樱花”的1500人旅行团，用近一周的时间遍游大阪、长崎等地，以一场视觉盛宴，打响2016年新年品牌建设第一役。表面上看，似乎仅仅是“游山玩水”，实际上也起到了拓展合作伙伴、员工的视野，从而增强对那些有能力进行大张旗鼓的品牌建设的企业而言，品牌建设的基础是文化，核心是产品设计，从而提供蕴含企业独特文化符号的产品，用品牌产生的联动效应促使企业的效益目标达成。而品牌建设的具体落地措施，各个企业的操作形式也各不相同。比如作为缝制设备行业的龙头企业上海和鹰科技，除了常规的品牌建设途径之外，近期正在组织“游日本，赏樱花”的1500人旅行团，用近一周的时间遍游大阪、长崎等地，以一场视觉盛宴，打响2016年新年品牌建设第一役。表面上看，似乎仅仅是“游山玩水”，实际上也起到了拓展合作伙伴、员工的视野，从而增强对那些有能力进行大张旗鼓的品牌建设的企业而言，品牌建设的基础是文化，核心是产品设计，从而提供蕴含企业独特文化符号的产品，用品牌产生的联动效应促使企业的效益目标达成。而品牌建设的具体落地措施，各个企业的操作形式也各不相同。比如作为缝制设备行业的龙头企业上海和鹰科技，除了常规的品牌建设途径之外，近期正在组织“游日本，赏樱花”的1500人旅行团，用近一周的时间遍游大阪、长崎等地，以一场视觉盛宴，打响2016年新年品牌建设第一役。表面上看，似乎仅仅是“游山玩水”，实际上也起到了拓展合作伙伴、员工的视野，从而增强', '[\".\\/Uploads\\/news\\/2017-05-23\\/5923e245df92a.jpg\",\".\\/Uploads\\/news\\/2017-05-23\\/5923e245e0cb2.jpeg\"]', '1495507129');
INSERT INTO `tp_news` VALUES ('11', 'vvvvvvvv', 'vvv', '<p>大企业忙于品牌建设，小企业忙于眼前利益的争夺\r\n\r\n品牌是企业的灵魂和存在与发展的核心动力。消费者对品牌的认同，意味着企业可以花费较少的成本让产品和服务具有更强的竞争力，从而获得更大的市场占有率。\r\n\r\n对那些有能力进行大张旗鼓的品牌建设的企业而言，品牌建设的基础是文化，核心是产品设计，从而提供蕴含企业独特文化符号的产品，用品牌产生的联动效应促使企业的效益目标达成。而品牌建设的具体落地措施，各个企业的操作形式也各不相同。比如作为缝制设备行业的龙头企业上海和鹰科技，除了常规的品牌建设途径之外，近期正在组织“游日本，赏樱花”的1500人旅行团，用近一周的时间遍游大阪、长崎等地，以一场视觉盛宴，打响2016年新年品牌建设第一役。表面上看，似乎仅仅是“游山玩水”，实际上也起到了拓展合作伙伴、员工的视野，从而增强对那些有能力进行大张旗鼓的品牌建设的企业而言，品牌建设的基础是文化，核心是产品设计，从而提供蕴含企业独特文化符号的产品，用品牌产生的联动效应促使企业的效益目标达成。而品牌建设的具体落地措施，各个企业的操作形式也各不相同。比如作为缝制设备行业的龙头企业上海和鹰科技，除了常规的品牌建设途径之外，近期正在组织“游日本，赏樱花”的1500人旅行团，用近一周的时间遍游大阪、长崎等地，以一场视觉盛宴，打响2016年新年品牌建设第一役。表面上看，似乎仅仅是“游山玩水”，实际上也起到了拓展合作伙伴、员工的视野，从而增强对那些有能力进行大张旗鼓的品牌建设的企业而言，品牌建设的基础是文化，核心是产品设计，从而提供蕴含企业独特文化符号的产品，用品牌产生的联动效应促使企业的效益目标达成。而品牌建设的具体落地措施，各个企业的操作形式也各不相同。比如作为缝制设备行业的龙头企业上海和鹰科技，除了常规的品牌建设途径之外，近期正在组织“游日本，赏樱花”的1500人旅行团，用近一周的时间遍游大阪、长崎等地，以一场视觉盛宴，打响2016年新年品牌建设第一役。表面上看，似乎仅仅是“游山玩水”，实际上也起到了拓展合作伙伴、员工的视野，从而增强对那些有能力进行大张旗鼓的品牌建设的企业而言，品牌建设的基础是文化，核心是产品设计，从而提供蕴含企业独特文化符号的产品，用品牌产生的联动效应促使企业的效益目标达成。而品牌建设的具体落地措施，各个企业的操作形式也各不相同。比如作为缝制设备行业的龙头企业上海和鹰科技，除了常规的品牌建设途径之外，近期正在组织“游日本，赏樱花”的1500人旅行团，用近一周的时间遍游大阪、长崎等地，以一场视觉盛宴，打响2016年新年品牌建设第一役。表面上看，似乎仅仅是“游山玩水”，实际上也起到了拓展合作伙伴、员工的视野，从而增强</p>', '[\".\\/Uploads\\/news\\/2017-05-26\\/5927929d3efc4.png\",\".\\/Uploads\\/news\\/2017-05-26\\/5927929d4881e.png\",\".\\/Uploads\\/news\\/2017-05-26\\/5927929d4af2e.png\",\".\\/Uploads\\/news\\/2017-05-26\\/5927929d4d63f.jpg\"]', '1495765661');
INSERT INTO `tp_news` VALUES ('12', '水电费', 'aaa', '<p>大企业忙于品牌建设，小企业忙于眼前利益的争夺\r\n\r\n品牌是企业的灵魂和存在与发展的核心动力。消费者对品牌的认同，意味着企业可以花费较少的成本让产品和服务具有更强的竞争力，从而获得更大的市场占有率。\r\n\r\n对那些有能力进行大张旗鼓的品牌建设的企业而言，品牌建设的基础是文化，核心是产品设计，从而提供蕴含企业独特文化符号的产品，用品牌产生的联动效应促使企业的效益目标达成。而品牌建设的具体落地措施，各个企业的操作形式也各不相同。比如作为缝制设备行业的龙头企业上海和鹰科技，除了常规的品牌建设途径之外，近期正在组织“游日本，赏樱花”的1500人旅行团，用近一周的时间遍游大阪、长崎等地，以一场视觉盛宴，打响2016年新年品牌建设第一役。表面上看，似乎仅仅是“游山玩水”，实际上也起到了拓展合作伙伴、员工的视野，从而增强对那些有能力进行大张旗鼓的品牌建设的企业而言，品牌建设的基础是文化，核心是产品设计，从而提供蕴含企业独特文化符号的产品，用品牌产生的联动效应促使企业的效益目标达成。而品牌建设的具体落地措施，各个企业的操作形式也各不相同。比如作为缝制设备行业的龙头企业上海和鹰科技，除了常规的品牌建设途径之外，近期正在组织“游日本，赏樱花”的1500人旅行团，用近一周的时间遍游大阪、长崎等地，以一场视觉盛宴，打响2016年新年品牌建设第一役。表面上看，似乎仅仅是“游山玩水”，实际上也起到了拓展合作伙伴、员工的视野，从而增强对那些有能力进行大张旗鼓的品牌建设的企业而言，品牌建设的基础是文化，核心是产品设计，从而提供蕴含企业独特文化符号的产品，用品牌产生的联动效应促使企业的效益目标达成。而品牌建设的具体落地措施，各个企业的操作形式也各不相同。比如作为缝制设备行业的龙头企业上海和鹰科技，除了常规的品牌建设途径之外，近期正在组织“游日本，赏樱花”的1500人旅行团，用近一周的时间遍游大阪、长崎等地，以一场视觉盛宴，打响2016年新年品牌建设第一役。表面上看，似乎仅仅是“游山玩水”，实际上也起到了拓展合作伙伴、员工的视野，从而增强对那些有能力进行大张旗鼓的品牌建设的企业而言，品牌建设的基础是文化，核心是产品设计，从而提供蕴含企业独特文化符号的产品，用品牌产生的联动效应促使企业的效益目标达成。而品牌建设的具体落地措施，各个企业的操作形式也各不相同。比如作为缝制设备行业的龙头企业上海和鹰科技，除了常规的品牌建设途径之外，近期正在组织“游日本，赏樱花”的1500人旅行团，用近一周的时间遍游大阪、长崎等地，以一场视觉盛宴，打响2016年新年品牌建设第一役。表面上看，似乎仅仅是“游山玩水”，实际上也起到了拓展合作伙伴、员工的视野，从而增强;</p>', '[\".\\/Uploads\\/news\\/2017-05-26\\/592794de77a13.jpg\",\".\\/Uploads\\/news\\/2017-05-26\\/592794de7956c.jpg\",\".\\/Uploads\\/news\\/2017-05-26\\/592794de7b0c4.jpg\",\".\\/Uploads\\/news\\/2017-05-26\\/592794de806b5.jpg\"]', '1495766238');
INSERT INTO `tp_news` VALUES ('13', '啪啪啪啪啪啪啪啪啪啪啪', '品牌', '<p>pppppppppppppppppppppppppppppppppp大企业忙于品牌建设，小企业忙于眼前利益的争夺\r\n\r\n品牌是企业的灵魂和存在与发展的核心动力。消费者对品牌的认同，意味着企业可以花费较少的成本让产品和服务具有更强的竞争力，从而获得更大的市场占有率。\r\n大企业忙于品牌建设，小企业忙于眼前利益的争夺\r\n\r\n品牌是企业的灵魂和存在与发展的核心动力。消费者对品牌的认同，意味着企业可以花费较少的成本让产品和服务具有更强的竞争力，从而获得更大的市场占有率。\r\n大企业忙于品牌建设，小企业忙于眼前利益的争夺\r\n\r\n品牌是企业的灵魂和存在与发展的核心动力。消费者对品牌的认同，意味着企业可以花费较少的成本让产品和服务具有更强的竞争力，从而获得更大的市场占有率。\r\n大企业忙于品牌建设，小企业忙于眼前利益的争夺\r\n\r\n品牌是企业的灵魂和存在与发展的核心动力。消费者对品牌的认同，意味着企业可以花费较少的成本让产品和服务具有更强的竞争力，从而获得更大的市场占有率。\r\n大企业忙于品牌建设，小企业忙于眼前利益的争夺\r\n\r\n品牌是企业的灵魂和存在与发展的核心动力。消费者对品牌的认同，意味着企业可以花费较少的成本让产品和服务具有更强的竞争力，从而获得更大的市场占有率。\r\n大企业忙于品牌建设，小企业忙于眼前利益的争夺\r\n\r\n品牌是企业的灵魂和存在与发展的核心动力。消费者对品牌的认同，意味着企业可以花费较少的成本让产品和服务具有更强的竞争力，从而获得更大的市场占有率。\r\n大企业忙于品牌建设，小企业忙于眼前利益的争夺\r\n\r\n品牌是企业的灵魂和存在与发展的核心动力。消费者对品牌的认同，意味着企业可以花费较少的成本让产品和服务具有更强的竞争力，从而获得更大的市场占有率。\r\n大企业忙于品牌建设，小企业忙于眼前利益的争夺\r\n\r\n品牌是企业的灵魂和存在与发展的核心动力。消费者对品牌的认同，意味着企业可以花费较少的成本让产品和服务具有更强的竞争力，从而获得更大的市场占有率。\r\n大企业忙于品牌建设，小企业忙于眼前利益的争夺\r\n\r\n品牌是企业的灵魂和存在与发展的核心动力。消费者对品牌的认同，意味着企业可以花费较少的成本让产品和服务具有更强的竞争力，从而获得更大的市场占有率。\r\n大企业忙于品牌建设，小企业忙于眼前利益的争夺\r\n\r\n品牌是企业的灵魂和存在与发展的核心动力。消费者对品牌的认同，意味着企业可以花费较少的成本让产品和服务具有更强的竞争力，从而获得更大的市场占有率。</p><p><img src=\"/ueditor/php/upload/image/20170531/1496220841213007.jpg\" title=\"1496220841213007.jpg\" alt=\"gamersky_09small_18_20175141132B36.jpg\"/></p><p>ppppppppppppppp<br/></p>', '[\".\\/Uploads\\/news\\/2017-05-31\\/592e84cb9bc9e.jpg\",\".\\/Uploads\\/news\\/2017-05-31\\/592e84cb9fb1f.jpg\"]', '1496220875');

-- ----------------------------
-- Table structure for `tp_order`
-- ----------------------------
DROP TABLE IF EXISTS `tp_order`;
CREATE TABLE `tp_order` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `order_num` bigint(13) unsigned NOT NULL,
  `pro_name` varchar(255) NOT NULL,
  `image` varchar(255) NOT NULL,
  `number` int(5) unsigned NOT NULL,
  `price` float(10,2) unsigned NOT NULL,
  `create_time` int(11) unsigned NOT NULL,
  `state` varchar(30) NOT NULL,
  `del` int(2) unsigned NOT NULL,
  `user_id` int(10) unsigned NOT NULL,
  `pro_id` int(10) unsigned NOT NULL,
  `name` varchar(40) NOT NULL,
  `phone` bigint(12) unsigned NOT NULL,
  `address` varchar(255) NOT NULL,
  `attr` varchar(255) NOT NULL,
  `delivery` varchar(30) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=28 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of tp_order
-- ----------------------------
INSERT INTO `tp_order` VALUES ('17', '14976627244', 'uuuueu', './Uploads/product/2017-05-27/59291aadba474.jpg', '1', '34.65', '1497662724', '已支付', '0', '4', '8', 'dssd', '2147483647', '山西省 太原市 市辖区 dsfsdf', '{\"8\":\"8\"}', '待发货');
INSERT INTO `tp_order` VALUES ('16', '14976627154', 'aaaaaa', './Uploads/product/2017-05-27/59291b191fc59.jpg', '5', '173.25', '1497662715', '已支付', '0', '4', '3', 'dssd', '2147483647', '山西省 太原市 市辖区 dsfsdf', '{\"a\":\"a\",\"c\":\"d\"}', '待发货');
INSERT INTO `tp_order` VALUES ('15', '14976626934', 'yyyy', './Uploads/product/2017-05-27/59291ac55d58b.jpg', '4', '138.60', '1497662693', '已支付', '0', '4', '7', 'dsfsd', '2147483647', '安徽省 合肥市 市辖区 dsfgsdg', '{\"r\":\"y\"}', '待发货');
INSERT INTO `tp_order` VALUES ('12', '14975777955', 'uuuueu', './Uploads/product/2017-05-27/59291aadba474.jpg', '1', '34.65', '1497577795', '已支付', '0', '5', '8', 'fdg', '2147483647', '吉林省 长春市 市辖区 dfgdfg', '{\"8\":\"8\"}', '待发货');
INSERT INTO `tp_order` VALUES ('13', '14976626464', 'bbbbb', './Uploads/product/2017-05-27/59291b0b5f0e7.jpg', '1', '34.65', '1497662646', '已支付', '0', '4', '4', 'dssd', '2147483647', '山西省 太原市 市辖区 dsfsdf', '{\"w\":\"w\",\"e\":\"e\",\"q\":\"q\"}', '待发货');
INSERT INTO `tp_order` VALUES ('11', '14975777955', 'yyyyy', './Uploads/product/2017-05-27/59291a9902651.jpg', '1', '34.65', '1497577795', '已支付', '0', '5', '9', 'fdg', '2147483647', '吉林省 长春市 市辖区 dfgdfg', '{\"7\":\"7\"}', '待发货');
INSERT INTO `tp_order` VALUES ('14', '14976626744', 'eeeee', './Uploads/product/2017-05-27/59291af32da56.jpg', '2', '69.30', '1497662674', '已支付', '0', '4', '5', 'sdsdf', '2147483647', '黑龙江省 哈尔滨市 市辖区 dsfsdfsdf', '{\"e\":\"y\",\"t\":\"h\"}', '待发货');
INSERT INTO `tp_order` VALUES ('18', '14976627384', 'yyyyy', './Uploads/product/2017-05-27/59291a9902651.jpg', '1', '34.65', '1497662738', '已支付', '0', '4', '9', 'dssd', '2147483647', '山西省 太原市 市辖区 dsfsdf', '{\"7\":\"7\"}', '已发货');
INSERT INTO `tp_order` VALUES ('19', '14976627724', 'eeeee', './Uploads/product/2017-05-27/59291a82eac0c.jpg', '1', '34.65', '1497662772', '已支付', '1', '4', '10', 'dssd', '2147483647', '山西省 太原市 市辖区 dsfsdf', '{\"3\":\"\\u4eba\",\"4\":\"\\u4eba\"}', '待发货');
INSERT INTO `tp_order` VALUES ('20', '14976691294', 'bbbbb', './Uploads/product/2017-05-27/59291b0b5f0e7.jpg', '2', '69.30', '1497669129', '已支付', '0', '4', '4', 'dssd', '2147483647', '山西省 太原市 市辖区 dsfsdf', '{\"w\":\"w\",\"e\":\"e\",\"q\":\"q\"}', '待发货');
INSERT INTO `tp_order` VALUES ('21', '14976691294', 'eeeee', './Uploads/product/2017-05-27/59291af32da56.jpg', '2', '69.30', '1497669129', '已支付', '0', '4', '5', 'dssd', '2147483647', '山西省 太原市 市辖区 dsfsdf', '{\"e\":\"y\",\"t\":\"h\"}', '待发货');
INSERT INTO `tp_order` VALUES ('23', '14978519124', 'yyyyy', './Uploads/product/2017-05-27/59291a9902651.jpg', '1', '34.65', '1497851912', '已支付', '0', '4', '9', 'dssd', '2147483647', '山西省 太原市 市辖区 dsfsdf', '{\"7\":\"7\"}', '已发货');
INSERT INTO `tp_order` VALUES ('24', '14978717604', 'aaaaaa', './Uploads/product/2017-05-27/59291b191fc59.jpg', '4', '138.60', '1497871760', '已支付', '0', '4', '3', 'dssd', '2147483647', '山西省 太原市 市辖区 dsfsdf', '{\"a\":\"b\",\"c\":\"s\"}', '待发货');
INSERT INTO `tp_order` VALUES ('25', '14980949644', 'aaaaaa', './Uploads/product/2017-05-27/59291b191fc59.jpg', '4', '138.60', '1498094964', '未支付', '0', '4', '3', 'dssd', '2147483647', '山西省 太原市 市辖区 dsfsdf', '{\"a\":\"b\",\"c\":\"s\"}', '待发货');
INSERT INTO `tp_order` VALUES ('26', '14980956654', 'bbbbb', './Uploads/product/2017-05-27/59291b0b5f0e7.jpg', '1', '34.65', '1498095665', '未支付', '0', '4', '4', '不不不不不不不', '18336253749', '天津市 市辖区 和平区 不不不不不不不不不', '{\"w\":\"w\",\"e\":\"e\",\"q\":\"q\"}', '已发货');
INSERT INTO `tp_order` VALUES ('27', '14981255424', 'bbbbb', './Uploads/product/2017-05-27/59291b0b5f0e7.jpg', '1', '34.65', '1498125542', '已支付', '0', '4', '4', 'dsfds', '18336253749', '北京市 市辖区 东城区 sdfsd', '{\"w\":\"w\",\"e\":\"e\",\"q\":\"q\"}', '待发货');

-- ----------------------------
-- Table structure for `tp_product`
-- ----------------------------
DROP TABLE IF EXISTS `tp_product`;
CREATE TABLE `tp_product` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `pro_name` varchar(255) NOT NULL,
  `cate` int(5) unsigned NOT NULL,
  `price` float(10,2) unsigned NOT NULL,
  `num` int(10) unsigned NOT NULL,
  `attr` text NOT NULL,
  `image` text NOT NULL,
  `content` text NOT NULL,
  `create_time` int(11) unsigned NOT NULL,
  `new_price` float(10,2) unsigned NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=11 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of tp_product
-- ----------------------------
INSERT INTO `tp_product` VALUES ('5', 'eeeee', '2', '34.65', '33', '{\"e\":[\"y\",\"y\",\"u\"],\"t\":[\"h\",\"h\",\"g\"]}', '[\".\\/Uploads\\/product\\/2017-05-27\\/59291af32da56.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291af330167.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291af333430.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291af335f28.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291af338a21.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291af33b902.jpg\"]', '&lt;p&gt;hhhhhhhhhhhhhhhhhhhh&lt;br/&gt;&lt;/p&gt;', '1495675747', '34.65');
INSERT INTO `tp_product` VALUES ('6', 'ettt', '2', '67.00', '76', '{\"t\":[\"y\",\"u\",\"t\"]}', '[\".\\/Uploads\\/product\\/2017-05-27\\/59291ae348c4a.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291ae34b35a.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291ae34de53.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291ae350d34.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291ae35382c.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291ae356325.jpg\"]', '&lt;p&gt;的鹅鹅鹅饿鹅鹅鹅饿鹅鹅鹅饿鹅鹅鹅饿&lt;br/&gt;&lt;/p&gt;', '1495693546', '34.65');
INSERT INTO `tp_product` VALUES ('3', 'aaaaaa', '1', '92.67', '22', '{\"a\":[\"a\",\"b\",\"c\",\"d\"],\"c\":[\"d\",\"s\",\"a\"]}', '[\".\\/Uploads\\/product\\/2017-05-27\\/59291b191fc59.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291b192524a.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291b1927d43.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291b192ac23.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291b192d71c.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291b1930215.jpg\"]', '&lt;p&gt;呃呃呃呃呃呃呃呃呃鹅鹅鹅鹅鹅鹅饿鹅鹅鹅饿&lt;br/&gt;&lt;/p&gt;', '1495593671', '34.65');
INSERT INTO `tp_product` VALUES ('4', 'bbbbb', '2', '34.65', '22', '{\"w\":[\"w\",\"ww\",\"w\"],\"e\":[\"e\",\"e\",\"ee\"],\"q\":[\"q\"]}', '[\".\\/Uploads\\/product\\/2017-05-27\\/59291b0b5f0e7.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291b0b61bdf.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291b0b64ac0.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291b0b675b9.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291b0b6a0b1.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291b0b6c7c2.jpg\"]', '&lt;p&gt;凄凄切切群群群群群群群群群群群群群群群群群群群群群群群群群群群群&lt;br/&gt;&lt;/p&gt;', '1495593829', '34.65');
INSERT INTO `tp_product` VALUES ('7', 'yyyy', '2', '54.00', '44', '{\"r\":[\"y\",\"t\",\"g\"]}', '[\".\\/Uploads\\/product\\/2017-05-27\\/59291ac55d58b.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291ac56046b.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291ac562b7c.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291ac565a5d.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291ac56893d.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291ac56b04e.jpg\"]', '&lt;p&gt;的点点滴滴多多多多多多多多多多&lt;br/&gt;&lt;/p&gt;', '1495693598', '34.65');
INSERT INTO `tp_product` VALUES ('8', 'uuuueu', '1', '88.88', '88', '{\"8\":[\"8\",\"8\",\"8\"]}', '[\".\\/Uploads\\/product\\/2017-05-27\\/59291aadba474.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291aadbcb84.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291aadbf67d.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291aadc255e.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291aadc5056.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291aadc7b4f.jpg\"]', '&lt;p&gt;ttttttttttttttttttttttttttttttttttttt&lt;br/&gt;&lt;/p&gt;', '1495693641', '34.65');
INSERT INTO `tp_product` VALUES ('9', 'yyyyy', '1', '77.00', '77', '{\"7\":[\"7\",\"7\",\"7\"]}', '[\".\\/Uploads\\/product\\/2017-05-27\\/59291a9902651.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291a9905149.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291a990802a.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291a990ab23.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291a990d61b.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291a9910114.jpg\"]', '&lt;p&gt;一月又一月晕晕晕晕晕晕晕晕晕晕&lt;br/&gt;&lt;/p&gt;', '1495693706', '34.65');
INSERT INTO `tp_product` VALUES ('10', 'eeeee', '1', '33.00', '33', '{\"3\":[\"\\u4eba\",\"\\u6211\",\"\\u662f\"],\"4\":[\"\\u4eba\",\"\\u4eba\",\"\\u4ed6\"]}', '[\".\\/Uploads\\/product\\/2017-05-27\\/59291a82eac0c.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291a8339ffb.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291a833ea34.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291a83420e5.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291a83453ae.jpg\",\".\\/Uploads\\/product\\/2017-05-27\\/59291a8347abf.jpg\"]', '&lt;p&gt;ssssssssssssssssssssssssssssssssssssssssssssssssss&lt;br/&gt;&lt;/p&gt;', '1495693750', '34.65');

-- ----------------------------
-- Table structure for `tp_product_cate`
-- ----------------------------
DROP TABLE IF EXISTS `tp_product_cate`;
CREATE TABLE `tp_product_cate` (
  `id` int(5) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(40) NOT NULL,
  `pid` int(5) unsigned NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=7 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of tp_product_cate
-- ----------------------------
INSERT INTO `tp_product_cate` VALUES ('1', '连衣裙', '0');
INSERT INTO `tp_product_cate` VALUES ('2', '外套', '0');
INSERT INTO `tp_product_cate` VALUES ('3', '针织衫', '0');
INSERT INTO `tp_product_cate` VALUES ('4', '上装', '0');
INSERT INTO `tp_product_cate` VALUES ('5', '下装', '0');

-- ----------------------------
-- Table structure for `tp_shopping_cart`
-- ----------------------------
DROP TABLE IF EXISTS `tp_shopping_cart`;
CREATE TABLE `tp_shopping_cart` (
  `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
  `pro_id` int(10) unsigned NOT NULL,
  `attr` varchar(200) NOT NULL,
  `collect` int(2) unsigned NOT NULL,
  `state` int(2) unsigned NOT NULL,
  `create_time` int(11) unsigned NOT NULL,
  `number` int(5) unsigned NOT NULL,
  `user_id` int(10) unsigned NOT NULL,
  `pro_name` varchar(255) NOT NULL,
  `image` varchar(255) NOT NULL,
  `num` int(10) NOT NULL,
  `price` float(10,2) NOT NULL,
  `new_price` float(10,2) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=MyISAM AUTO_INCREMENT=20 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of tp_shopping_cart
-- ----------------------------
INSERT INTO `tp_shopping_cart` VALUES ('8', '8', '{\"8\":\"8\"}', '0', '0', '1497320497', '2', '4', 'uuuueu', './Uploads/product/2017-05-27/59291aadba474.jpg', '88', '88.88', '34.65');
INSERT INTO `tp_shopping_cart` VALUES ('7', '4', '{\"w\":\"w\",\"e\":\"e\",\"q\":\"q\"}', '0', '0', '1497320487', '1', '4', 'bbbbb', './Uploads/product/2017-05-27/59291b0b5f0e7.jpg', '22', '34.65', '34.65');
INSERT INTO `tp_shopping_cart` VALUES ('9', '10', '{\"3\":\"我\",\"4\":\"他\"}', '0', '0', '1497320525', '3', '4', 'eeeee', './Uploads/product/2017-05-27/59291a82eac0c.jpg', '33', '33.00', '34.65');
INSERT INTO `tp_shopping_cart` VALUES ('10', '3', '{\"a\":\"b\",\"c\":\"s\"}', '1', '0', '1497320541', '4', '4', 'aaaaaa', './Uploads/product/2017-05-27/59291b191fc59.jpg', '22', '92.67', '34.65');
INSERT INTO `tp_shopping_cart` VALUES ('11', '8', '{\"8\":\"8\"}', '0', '0', '1497577706', '1', '5', 'uuuueu', './Uploads/product/2017-05-27/59291aadba474.jpg', '88', '88.88', '34.65');
INSERT INTO `tp_shopping_cart` VALUES ('12', '9', '{\"7\":\"7\"}', '0', '0', '1497577713', '1', '5', 'yyyyy', './Uploads/product/2017-05-27/59291a9902651.jpg', '77', '77.00', '34.65');
INSERT INTO `tp_shopping_cart` VALUES ('19', '4', '{\"w\":\"w\",\"e\":\"e\",\"q\":\"q\"}', '1', '0', '1497662623', '1', '4', 'bbbbb', './Uploads/product/2017-05-27/59291b0b5f0e7.jpg', '22', '34.65', '34.65');
